name: "ResNet"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 448
input_dim: 448
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "conv1"
	top: "conv1"
	name: "bn_conv1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "conv1"
	top: "conv1"
	name: "scale_conv1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "new_conv1"
  type: "Convolution"
  bottom: "conv1"
  top: "new_conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "new_conv1"
	top: "new_conv1"
	name: "bn_new_conv1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "new_conv1"
	top: "new_conv1"
	name: "scale_new_conv1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "new_conv1_relu"
  type: "ReLU"
  bottom: "new_conv1"
  top: "new_conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "new_conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2a_branch1"
	top: "res2a_branch1"
	name: "bn2a_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2a_branch1"
	top: "res2a_branch1"
	name: "scale2a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2a_branch2a"
	top: "res2a_branch2a"
	name: "bn21_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2a_branch2a"
	top: "res2a_branch2a"
	name: "scale21_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2a_branch2b"
	top: "res2a_branch2b"
	name: "bn21_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2a_branch2b"
	top: "res2a_branch2b"
	name: "scale21_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2a_branch2c"
	top: "res2a_branch2c"
	name: "bn21_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2a_branch2c"
	top: "res2a_branch2c"
	name: "scale21_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  name: "res2a"
  top: "res2a"
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2b_branch2a"
	top: "res2b_branch2a"
	name: "bn22_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2b_branch2a"
	top: "res2b_branch2a"
	name: "scale22_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2b_branch2b"
	top: "res2b_branch2b"
	name: "bn22_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2b_branch2b"
	top: "res2b_branch2b"
	name: "scale22_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2b_branch2c"
	top: "res2b_branch2c"
	name: "bn22_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2b_branch2c"
	top: "res2b_branch2c"
	name: "scale22_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  name: "res2b"
  top: "res2b"
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2c_branch2a"
	top: "res2c_branch2a"
	name: "bn23_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2c_branch2a"
	top: "res2c_branch2a"
	name: "scale23_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2c_branch2b"
	top: "res2c_branch2b"
	name: "bn23_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2c_branch2b"
	top: "res2c_branch2b"
	name: "scale23_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2c_branch2c"
	top: "res2c_branch2c"
	name: "bn23_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2c_branch2c"
	top: "res2c_branch2c"
	name: "scale23_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res2b"
  bottom: "res2c_branch2c"
  name: "res2c"
  top: "res2c"
}
layer {
  name: "res2c_relu"
  type: "ReLU"
  bottom: "res2c"
  top: "res2c"
}
layer {
  name: "res3_1_branch1"
  type: "Convolution"
  bottom: "res2c"
  top: "res3_1_branch1"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2_1_branch1"
	top: "res2_1_branch1"
	name: "bn3_1_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res2_1_branch1"
	top: "res2_1_branch1"
	name: "scale3_1_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_1_branch2a"
  type: "Convolution"
  bottom: "res2c"
  top: "res3_1_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_1_branch2a"
	top: "res3_1_branch2a"
	name: "bn3_1_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_1_branch2a"
	top: "res3_1_branch2a"
	name: "scale3_1_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_1_branch2a_relu"
  type: "ReLU"
  bottom: "res3_1_branch2a"
  top: "res3_1_branch2a"
}
layer {
  name: "res3_1_branch2b"
  type: "Convolution"
  bottom: "res3_1_branch2a"
  top: "res3_1_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_1_branch2b"
	top: "res3_1_branch2b"
	name: "bn3_1_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_1_branch2b"
	top: "res3_1_branch2b"
	name: "scale3_1_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_1_branch2b_relu"
  type: "ReLU"
  bottom: "res3_1_branch2b"
  top: "res3_1_branch2b"
}
layer {
  name: "res3_1_branch2c"
  type: "Convolution"
  bottom: "res3_1_branch2b"
  top: "res3_1_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_1_branch2c"
	top: "res3_1_branch2c"
	name: "bn3_1_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_1_branch2c"
	top: "res3_1_branch2c"
	name: "scale3_1_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_1_branch1"
  bottom: "res3_1_branch2c"
  name: "res3_1"
  top: "res3_1"
}
layer {
  name: "res3_1_relu"
  type: "ReLU"
  bottom: "res3_1"
  top: "res3_1"
}
layer {
  name: "res3_2_branch2a"
  type: "Convolution"
  bottom: "res3_1"
  top: "res3_2_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_2_branch2a"
	top: "res3_2_branch2a"
	name: "bn3_2_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_2_branch2a"
	top: "res3_2_branch2a"
	name: "scale3_2_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_2_branch2a_relu"
  type: "ReLU"
  bottom: "res3_2_branch2a"
  top: "res3_2_branch2a"
}
layer {
  name: "res3_2_branch2b"
  type: "Convolution"
  bottom: "res3_2_branch2a"
  top: "res3_2_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_2_branch2b"
	top: "res3_2_branch2b"
	name: "bn3_2_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_2_branch2b"
	top: "res3_2_branch2b"
	name: "scale3_2_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_2_branch2b_relu"
  type: "ReLU"
  bottom: "res3_2_branch2b"
  top: "res3_2_branch2b"
}
layer {
  name: "res3_2_branch2c"
  type: "Convolution"
  bottom: "res3_2_branch2b"
  top: "res3_2_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_2_branch2c"
	top: "res3_2_branch2c"
	name: "bn3_2_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_2_branch2c"
	top: "res3_2_branch2c"
	name: "scale3_2_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_1"
  bottom: "res3_2_branch2c"
  name: "res3_2"
  top: "res3_2"
}
layer {
  name: "res3_2_relu"
  type: "ReLU"
  bottom: "res3_2"
  top: "res3_2"
}
layer {
  name: "res3_3_branch2a"
  type: "Convolution"
  bottom: "res3_2"
  top: "res3_3_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_3_branch2a"
	top: "res3_3_branch2a"
	name: "bn3_3_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_3_branch2a"
	top: "res3_3_branch2a"
	name: "scale3_3_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_3_branch2a_relu"
  type: "ReLU"
  bottom: "res3_3_branch2a"
  top: "res3_3_branch2a"
}
layer {
  name: "res3_3_branch2b"
  type: "Convolution"
  bottom: "res3_3_branch2a"
  top: "res3_3_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_3_branch2b"
	top: "res3_3_branch2b"
	name: "bn3_3_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_3_branch2b"
	top: "res3_3_branch2b"
	name: "scale3_3_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_3_branch2b_relu"
  type: "ReLU"
  bottom: "res3_3_branch2b"
  top: "res3_3_branch2b"
}
layer {
  name: "res3_3_branch2c"
  type: "Convolution"
  bottom: "res3_3_branch2b"
  top: "res3_3_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_3_branch2c"
	top: "res3_3_branch2c"
	name: "bn3_3_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_3_branch2c"
	top: "res3_3_branch2c"
	name: "scale3_3_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_2"
  bottom: "res3_3_branch2c"
  name: "res3_3"
  top: "res3_3"
}
layer {
  name: "res3_3_relu"
  type: "ReLU"
  bottom: "res3_3"
  top: "res3_3"
}
layer {
  name: "res3_4_branch2a"
  type: "Convolution"
  bottom: "res3_3"
  top: "res3_4_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_4_branch2a"
	top: "res3_4_branch2a"
	name: "bn3_4_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_4_branch2a"
	top: "res3_4_branch2a"
	name: "scale3_4_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_4_branch2a_relu"
  type: "ReLU"
  bottom: "res3_4_branch2a"
  top: "res3_4_branch2a"
}
layer {
  name: "res3_4_branch2b"
  type: "Convolution"
  bottom: "res3_4_branch2a"
  top: "res3_4_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_4_branch2b"
	top: "res3_4_branch2b"
	name: "bn3_4_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_4_branch2b"
	top: "res3_4_branch2b"
	name: "scale3_4_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_4_branch2b_relu"
  type: "ReLU"
  bottom: "res3_4_branch2b"
  top: "res3_4_branch2b"
}
layer {
  name: "res3_4_branch2c"
  type: "Convolution"
  bottom: "res3_4_branch2b"
  top: "res3_4_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_4_branch2c"
	top: "res3_4_branch2c"
	name: "bn3_4_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_4_branch2c"
	top: "res3_4_branch2c"
	name: "scale3_4_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_3"
  bottom: "res3_4_branch2c"
  name: "res3_4"
  top: "res3_4"
}
layer {
  name: "res3_4_relu"
  type: "ReLU"
  bottom: "res3_4"
  top: "res3_4"
}
layer {
  name: "res3_5_branch2a"
  type: "Convolution"
  bottom: "res3_4"
  top: "res3_5_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_5_branch2a"
	top: "res3_5_branch2a"
	name: "bn3_5_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_5_branch2a"
	top: "res3_5_branch2a"
	name: "scale3_5_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_5_branch2a_relu"
  type: "ReLU"
  bottom: "res3_5_branch2a"
  top: "res3_5_branch2a"
}
layer {
  name: "res3_5_branch2b"
  type: "Convolution"
  bottom: "res3_5_branch2a"
  top: "res3_5_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_5_branch2b"
	top: "res3_5_branch2b"
	name: "bn3_5_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_5_branch2b"
	top: "res3_5_branch2b"
	name: "scale3_5_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_5_branch2b_relu"
  type: "ReLU"
  bottom: "res3_5_branch2b"
  top: "res3_5_branch2b"
}
layer {
  name: "res3_5_branch2c"
  type: "Convolution"
  bottom: "res3_5_branch2b"
  top: "res3_5_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_5_branch2c"
	top: "res3_5_branch2c"
	name: "bn3_5_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_5_branch2c"
	top: "res3_5_branch2c"
	name: "scale3_5_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_4"
  bottom: "res3_5_branch2c"
  name: "res3_5"
  top: "res3_5"
}
layer {
  name: "res3_5_relu"
  type: "ReLU"
  bottom: "res3_5"
  top: "res3_5"
}
layer {
  name: "res3_6_branch2a"
  type: "Convolution"
  bottom: "res3_5"
  top: "res3_6_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_6_branch2a"
	top: "res3_6_branch2a"
	name: "bn3_6_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_6_branch2a"
	top: "res3_6_branch2a"
	name: "scale3_6_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_6_branch2a_relu"
  type: "ReLU"
  bottom: "res3_6_branch2a"
  top: "res3_6_branch2a"
}
layer {
  name: "res3_6_branch2b"
  type: "Convolution"
  bottom: "res3_6_branch2a"
  top: "res3_6_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_6_branch2b"
	top: "res3_6_branch2b"
	name: "bn3_6_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_6_branch2b"
	top: "res3_6_branch2b"
	name: "scale3_6_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_6_branch2b_relu"
  type: "ReLU"
  bottom: "res3_6_branch2b"
  top: "res3_6_branch2b"
}
layer {
  name: "res3_6_branch2c"
  type: "Convolution"
  bottom: "res3_6_branch2b"
  top: "res3_6_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_6_branch2c"
	top: "res3_6_branch2c"
	name: "bn3_6_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_6_branch2c"
	top: "res3_6_branch2c"
	name: "scale3_6_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_5"
  bottom: "res3_6_branch2c"
  name: "res3_6"
  top: "res3_6"
}
layer {
  name: "res3_6_relu"
  type: "ReLU"
  bottom: "res3_6"
  top: "res3_6"
}
layer {
  name: "res3_7_branch2a"
  type: "Convolution"
  bottom: "res3_6"
  top: "res3_7_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_7_branch2a"
	top: "res3_7_branch2a"
	name: "bn3_7_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_7_branch2a"
	top: "res3_7_branch2a"
	name: "scale3_7_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_7_branch2a_relu"
  type: "ReLU"
  bottom: "res3_7_branch2a"
  top: "res3_7_branch2a"
}
layer {
  name: "res3_7_branch2b"
  type: "Convolution"
  bottom: "res3_7_branch2a"
  top: "res3_7_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_7_branch2b"
	top: "res3_7_branch2b"
	name: "bn3_7_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_7_branch2b"
	top: "res3_7_branch2b"
	name: "scale3_7_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_7_branch2b_relu"
  type: "ReLU"
  bottom: "res3_7_branch2b"
  top: "res3_7_branch2b"
}
layer {
  name: "res3_7_branch2c"
  type: "Convolution"
  bottom: "res3_7_branch2b"
  top: "res3_7_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_7_branch2c"
	top: "res3_7_branch2c"
	name: "bn3_7_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_7_branch2c"
	top: "res3_7_branch2c"
	name: "scale3_7_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_6"
  bottom: "res3_7_branch2c"
  name: "res3_7"
  top: "res3_7"
}
layer {
  name: "res3_7_relu"
  type: "ReLU"
  bottom: "res3_7"
  top: "res3_7"
}
layer {
  name: "res3_8_branch2a"
  type: "Convolution"
  bottom: "res3_7"
  top: "res3_8_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_8_branch2a"
	top: "res3_8_branch2a"
	name: "bn3_8_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_8_branch2a"
	top: "res3_8_branch2a"
	name: "scale3_8_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_8_branch2a_relu"
  type: "ReLU"
  bottom: "res3_8_branch2a"
  top: "res3_8_branch2a"
}
layer {
  name: "res3_8_branch2b"
  type: "Convolution"
  bottom: "res3_8_branch2a"
  top: "res3_8_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_8_branch2b"
	top: "res3_8_branch2b"
	name: "bn3_8_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_8_branch2b"
	top: "res3_8_branch2b"
	name: "scale3_8_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_8_branch2b_relu"
  type: "ReLU"
  bottom: "res3_8_branch2b"
  top: "res3_8_branch2b"
}
layer {
  name: "res3_8_branch2c"
  type: "Convolution"
  bottom: "res3_8_branch2b"
  top: "res3_8_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_8_branch2c"
	top: "res3_8_branch2c"
	name: "bn3_8_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res3_8_branch2c"
	top: "res3_8_branch2c"
	name: "scale3_8_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_7"
  bottom: "res3_8_branch2c"
  name: "res3_8"
  top: "res3_8"
}
layer {
  name: "res3_8_relu"
  type: "ReLU"
  bottom: "res3_8"
  top: "res3_8"
}
layer {
  name: "res4_1_branch1"
  type: "Convolution"
  bottom: "res3_8"
  top: "res4_1_branch1"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_1_branch1"
	top: "res4_1_branch1"
	name: "bn4_1_branch1"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_1_branch1"
	top: "res4_1_branch1"
	name: "scale4_1_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_1_branch2a"
  type: "Convolution"
  bottom: "res3_8"
  top: "res4_1_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_1_branch2a"
	top: "res4_1_branch2a"
	name: "bn4_1_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_1_branch2a"
	top: "res4_1_branch2a"
	name: "scale4_1_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_1_branch2a_relu"
  type: "ReLU"
  bottom: "res4_1_branch2a"
  top: "res4_1_branch2a"
}
layer {
  name: "res4_1_branch2b"
  type: "Convolution"
  bottom: "res4_1_branch2a"
  top: "res4_1_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_1_branch2b"
	top: "res4_1_branch2b"
	name: "bn4_1_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_1_branch2b"
	top: "res4_1_branch2b"
	name: "scale4_1_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_1_branch2b_relu"
  type: "ReLU"
  bottom: "res4_1_branch2b"
  top: "res4_1_branch2b"
}
layer {
  name: "res4_1_branch2c"
  type: "Convolution"
  bottom: "res4_1_branch2b"
  top: "res4_1_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_1_branch2c"
	top: "res4_1_branch2c"
	name: "bn4_1_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_1_branch2c"
	top: "res4_1_branch2c"
	name: "scale4_1_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_1_branch1"
  bottom: "res4_1_branch2c"
  name: "res4_1"
  top: "res4_1"
}
layer {
  name: "res4_1_relu"
  type: "ReLU"
  bottom: "res4_1"
  top: "res4_1"
}
layer {
  name: "res4_2_branch2a"
  type: "Convolution"
  bottom: "res4_1"
  top: "res4_2_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_2_branch2a"
	top: "res4_2_branch2a"
	name: "bn4_2_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_2_branch2a"
	top: "res4_2_branch2a"
	name: "scale4_2_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_2_branch2a_relu"
  type: "ReLU"
  bottom: "res4_2_branch2a"
  top: "res4_2_branch2a"
}
layer {
  name: "res4_2_branch2b"
  type: "Convolution"
  bottom: "res4_2_branch2a"
  top: "res4_2_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_2_branch2b"
	top: "res4_2_branch2b"
	name: "bn4_2_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_2_branch2b"
	top: "res4_2_branch2b"
	name: "scale4_2_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_2_branch2b_relu"
  type: "ReLU"
  bottom: "res4_2_branch2b"
  top: "res4_2_branch2b"
}
layer {
  name: "res4_2_branch2c"
  type: "Convolution"
  bottom: "res4_2_branch2b"
  top: "res4_2_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_2_branch2c"
	top: "res4_2_branch2c"
	name: "bn4_2_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_2_branch2c"
	top: "res4_2_branch2c"
	name: "scale4_2_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_1"
  bottom: "res4_2_branch2c"
  name: "res4_2"
  top: "res4_2"
}
layer {
  name: "res4_2_relu"
  type: "ReLU"
  bottom: "res4_2"
  top: "res4_2"
}
layer {
  name: "res4_3_branch2a"
  type: "Convolution"
  bottom: "res4_2"
  top: "res4_3_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_3_branch2a"
	top: "res4_3_branch2a"
	name: "bn4_3_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_3_branch2a"
	top: "res4_3_branch2a"
	name: "scale4_3_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_3_branch2a_relu"
  type: "ReLU"
  bottom: "res4_3_branch2a"
  top: "res4_3_branch2a"
}
layer {
  name: "res4_3_branch2b"
  type: "Convolution"
  bottom: "res4_3_branch2a"
  top: "res4_3_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_3_branch2b"
	top: "res4_3_branch2b"
	name: "bn4_3_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_3_branch2b"
	top: "res4_3_branch2b"
	name: "scale4_3_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_3_branch2b_relu"
  type: "ReLU"
  bottom: "res4_3_branch2b"
  top: "res4_3_branch2b"
}
layer {
  name: "res4_3_branch2c"
  type: "Convolution"
  bottom: "res4_3_branch2b"
  top: "res4_3_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_3_branch2c"
	top: "res4_3_branch2c"
	name: "bn4_3_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_3_branch2c"
	top: "res4_3_branch2c"
	name: "scale4_3_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_2"
  bottom: "res4_3_branch2c"
  name: "res4_3"
  top: "res4_3"
}
layer {
  name: "res4_3_relu"
  type: "ReLU"
  bottom: "res4_3"
  top: "res4_3"
}
layer {
  name: "res4_4_branch2a"
  type: "Convolution"
  bottom: "res4_3"
  top: "res4_4_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_4_branch2a"
	top: "res4_4_branch2a"
	name: "bn4_4_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_4_branch2a"
	top: "res4_4_branch2a"
	name: "scale4_4_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_4_branch2a_relu"
  type: "ReLU"
  bottom: "res4_4_branch2a"
  top: "res4_4_branch2a"
}
layer {
  name: "res4_4_branch2b"
  type: "Convolution"
  bottom: "res4_4_branch2a"
  top: "res4_4_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_4_branch2b"
	top: "res4_4_branch2b"
	name: "bn4_4_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_4_branch2b"
	top: "res4_4_branch2b"
	name: "scale4_4_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_4_branch2b_relu"
  type: "ReLU"
  bottom: "res4_4_branch2b"
  top: "res4_4_branch2b"
}
layer {
  name: "res4_4_branch2c"
  type: "Convolution"
  bottom: "res4_4_branch2b"
  top: "res4_4_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_4_branch2c"
	top: "res4_4_branch2c"
	name: "bn4_4_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_4_branch2c"
	top: "res4_4_branch2c"
	name: "scale4_4_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_3"
  bottom: "res4_4_branch2c"
  name: "res4_4"
  top: "res4_4"
}
layer {
  name: "res4_4_relu"
  type: "ReLU"
  bottom: "res4_4"
  top: "res4_4"
}
layer {
  name: "res4_5_branch2a"
  type: "Convolution"
  bottom: "res4_4"
  top: "res4_5_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_5_branch2a"
	top: "res4_5_branch2a"
	name: "bn4_5_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_5_branch2a"
	top: "res4_5_branch2a"
	name: "scale4_5_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_5_branch2a_relu"
  type: "ReLU"
  bottom: "res4_5_branch2a"
  top: "res4_5_branch2a"
}
layer {
  name: "res4_5_branch2b"
  type: "Convolution"
  bottom: "res4_5_branch2a"
  top: "res4_5_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_5_branch2b"
	top: "res4_5_branch2b"
	name: "bn4_5_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_5_branch2b"
	top: "res4_5_branch2b"
	name: "scale4_5_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_5_branch2b_relu"
  type: "ReLU"
  bottom: "res4_5_branch2b"
  top: "res4_5_branch2b"
}
layer {
  name: "res4_5_branch2c"
  type: "Convolution"
  bottom: "res4_5_branch2b"
  top: "res4_5_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_5_branch2c"
	top: "res4_5_branch2c"
	name: "bn4_5_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_5_branch2c"
	top: "res4_5_branch2c"
	name: "scale4_5_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_4"
  bottom: "res4_5_branch2c"
  name: "res4_5"
  top: "res4_5"
}
layer {
  name: "res4_5_relu"
  type: "ReLU"
  bottom: "res4_5"
  top: "res4_5"
}
layer {
  name: "res4_6_branch2a"
  type: "Convolution"
  bottom: "res4_5"
  top: "res4_6_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_6_branch2a"
	top: "res4_6_branch2a"
	name: "bn4_6_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_6_branch2a"
	top: "res4_6_branch2a"
	name: "scale4_6_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_6_branch2a_relu"
  type: "ReLU"
  bottom: "res4_6_branch2a"
  top: "res4_6_branch2a"
}
layer {
  name: "res4_6_branch2b"
  type: "Convolution"
  bottom: "res4_6_branch2a"
  top: "res4_6_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_6_branch2b"
	top: "res4_6_branch2b"
	name: "bn4_6_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_6_branch2b"
	top: "res4_6_branch2b"
	name: "scale4_6_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_6_branch2b_relu"
  type: "ReLU"
  bottom: "res4_6_branch2b"
  top: "res4_6_branch2b"
}
layer {
  name: "res4_6_branch2c"
  type: "Convolution"
  bottom: "res4_6_branch2b"
  top: "res4_6_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_6_branch2c"
	top: "res4_6_branch2c"
	name: "bn4_6_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_6_branch2c"
	top: "res4_6_branch2c"
	name: "scale4_6_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_5"
  bottom: "res4_6_branch2c"
  name: "res4_6"
  top: "res4_6"
}
layer {
  name: "res4_6_relu"
  type: "ReLU"
  bottom: "res4_6"
  top: "res4_6"
}
layer {
  name: "res4_7_branch2a"
  type: "Convolution"
  bottom: "res4_6"
  top: "res4_7_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_7_branch2a"
	top: "res4_7_branch2a"
	name: "bn4_7_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_7_branch2a"
	top: "res4_7_branch2a"
	name: "scale4_7_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_7_branch2a_relu"
  type: "ReLU"
  bottom: "res4_7_branch2a"
  top: "res4_7_branch2a"
}
layer {
  name: "res4_7_branch2b"
  type: "Convolution"
  bottom: "res4_7_branch2a"
  top: "res4_7_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_7_branch2b"
	top: "res4_7_branch2b"
	name: "bn4_7_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_7_branch2b"
	top: "res4_7_branch2b"
	name: "scale4_7_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_7_branch2b_relu"
  type: "ReLU"
  bottom: "res4_7_branch2b"
  top: "res4_7_branch2b"
}
layer {
  name: "res4_7_branch2c"
  type: "Convolution"
  bottom: "res4_7_branch2b"
  top: "res4_7_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_7_branch2c"
	top: "res4_7_branch2c"
	name: "bn4_7_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_7_branch2c"
	top: "res4_7_branch2c"
	name: "scale4_7_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_6"
  bottom: "res4_7_branch2c"
  name: "res4_7"
  top: "res4_7"
}
layer {
  name: "res4_7_relu"
  type: "ReLU"
  bottom: "res4_7"
  top: "res4_7"
}
layer {
  name: "res4_8_branch2a"
  type: "Convolution"
  bottom: "res4_7"
  top: "res4_8_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_8_branch2a"
	top: "res4_8_branch2a"
	name: "bn4_8_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_8_branch2a"
	top: "res4_8_branch2a"
	name: "scale4_8_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_8_branch2a_relu"
  type: "ReLU"
  bottom: "res4_8_branch2a"
  top: "res4_8_branch2a"
}
layer {
  name: "res4_8_branch2b"
  type: "Convolution"
  bottom: "res4_8_branch2a"
  top: "res4_8_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_8_branch2b"
	top: "res4_8_branch2b"
	name: "bn4_8_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_8_branch2b"
	top: "res4_8_branch2b"
	name: "scale4_8_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_8_branch2b_relu"
  type: "ReLU"
  bottom: "res4_8_branch2b"
  top: "res4_8_branch2b"
}
layer {
  name: "res4_8_branch2c"
  type: "Convolution"
  bottom: "res4_8_branch2b"
  top: "res4_8_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_8_branch2c"
	top: "res4_8_branch2c"
	name: "bn4_8_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_8_branch2c"
	top: "res4_8_branch2c"
	name: "scale4_8_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_7"
  bottom: "res4_8_branch2c"
  name: "res4_8"
  top: "res4_8"
}
layer {
  name: "res4_8_relu"
  type: "ReLU"
  bottom: "res4_8"
  top: "res4_8"
}
layer {
  name: "res4_9_branch2a"
  type: "Convolution"
  bottom: "res4_8"
  top: "res4_9_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_9_branch2a"
	top: "res4_9_branch2a"
	name: "bn4_9_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_9_branch2a"
	top: "res4_9_branch2a"
	name: "scale4_9_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_9_branch2a_relu"
  type: "ReLU"
  bottom: "res4_9_branch2a"
  top: "res4_9_branch2a"
}
layer {
  name: "res4_9_branch2b"
  type: "Convolution"
  bottom: "res4_9_branch2a"
  top: "res4_9_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_9_branch2b"
	top: "res4_9_branch2b"
	name: "bn4_9_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_9_branch2b"
	top: "res4_9_branch2b"
	name: "scale4_9_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_9_branch2b_relu"
  type: "ReLU"
  bottom: "res4_9_branch2b"
  top: "res4_9_branch2b"
}
layer {
  name: "res4_9_branch2c"
  type: "Convolution"
  bottom: "res4_9_branch2b"
  top: "res4_9_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_9_branch2c"
	top: "res4_9_branch2c"
	name: "bn4_9_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_9_branch2c"
	top: "res4_9_branch2c"
	name: "scale4_9_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_8"
  bottom: "res4_9_branch2c"
  name: "res4_9"
  top: "res4_9"
}
layer {
  name: "res4_9_relu"
  type: "ReLU"
  bottom: "res4_9"
  top: "res4_9"
}
layer {
  name: "res4_10_branch2a"
  type: "Convolution"
  bottom: "res4_9"
  top: "res4_10_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_10_branch2a"
	top: "res4_10_branch2a"
	name: "bn4_10_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_10_branch2a"
	top: "res4_10_branch2a"
	name: "scale4_10_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_10_branch2a_relu"
  type: "ReLU"
  bottom: "res4_10_branch2a"
  top: "res4_10_branch2a"
}
layer {
  name: "res4_10_branch2b"
  type: "Convolution"
  bottom: "res4_10_branch2a"
  top: "res4_10_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_10_branch2b"
	top: "res4_10_branch2b"
	name: "bn4_10_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_10_branch2b"
	top: "res4_10_branch2b"
	name: "scale4_10_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_10_branch2b_relu"
  type: "ReLU"
  bottom: "res4_10_branch2b"
  top: "res4_10_branch2b"
}
layer {
  name: "res4_10_branch2c"
  type: "Convolution"
  bottom: "res4_10_branch2b"
  top: "res4_10_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_10_branch2c"
	top: "res4_10_branch2c"
	name: "bn4_10_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_10_branch2c"
	top: "res4_10_branch2c"
	name: "scale4_10_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_9"
  bottom: "res4_10_branch2c"
  name: "res4_10"
  top: "res4_10"
}
layer {
  name: "res4_10_relu"
  type: "ReLU"
  bottom: "res4_10"
  top: "res4_10"
}
layer {
  name: "res4_11_branch2a"
  type: "Convolution"
  bottom: "res4_10"
  top: "res4_11_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_11_branch2a"
	top: "res4_11_branch2a"
	name: "bn4_11_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_11_branch2a"
	top: "res4_11_branch2a"
	name: "scale4_11_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_11_branch2a_relu"
  type: "ReLU"
  bottom: "res4_11_branch2a"
  top: "res4_11_branch2a"
}
layer {
  name: "res4_11_branch2b"
  type: "Convolution"
  bottom: "res4_11_branch2a"
  top: "res4_11_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_11_branch2b"
	top: "res4_11_branch2b"
	name: "bn4_11_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_11_branch2b"
	top: "res4_11_branch2b"
	name: "scale4_11_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_11_branch2b_relu"
  type: "ReLU"
  bottom: "res4_11_branch2b"
  top: "res4_11_branch2b"
}
layer {
  name: "res4_11_branch2c"
  type: "Convolution"
  bottom: "res4_11_branch2b"
  top: "res4_11_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_11_branch2c"
	top: "res4_11_branch2c"
	name: "bn4_11_branch2c"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_11_branch2c"
	top: "res4_11_branch2c"
	name: "scale4_11_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_10"
  bottom: "res4_11_branch2c"
  name: "res4_11"
  top: "res4_11"
}
layer {
  name: "res4_11_relu"
  type: "ReLU"
  bottom: "res4_11"
  top: "res4_11"
}
layer {
  name: "res4_12_branch2a"
  type: "Convolution"
  bottom: "res4_11"
  top: "res4_12_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_12_branch2a"
	top: "res4_12_branch2a"
	name: "bn4_12_branch2a"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_12_branch2a"
	top: "res4_12_branch2a"
	name: "scale4_12_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_12_branch2a_relu"
  type: "ReLU"
  bottom: "res4_12_branch2a"
  top: "res4_12_branch2a"
}
layer {
  name: "res4_12_branch2b"
  type: "Convolution"
  bottom: "res4_12_branch2a"
  top: "res4_12_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_12_branch2b"
	top: "res4_12_branch2b"
	name: "bn4_12_branch2b"
	type: "BatchNorm"
	batch_norm_param {
		use_global_stats: true
	}
}
layer {
	bottom: "res4_12_branch2b"
	top: "res4_12_branch2b"
	name: "scale4_12_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_12_branch2b_relu"
  type: "ReLU"
  bottom: "res4_12_branch2b"
  top: "res4_12_branch2b"
}
layer {
  name: "res4_12_branch2c"
  type: "Convolution"
