name: "ResNet"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 448
input_dim: 448
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "conv1"
	top: "bn_conv1"
	name: "bn_conv1"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "conv1"
	top: "bn_conv1"
	name: "bn_conv1"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn_conv1"
	top: "scale_conv1"
	name: "scale_conv1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "scale_conv1"
  top: "conv1_relu"
}
layer {
  name: "new_conv1"
  type: "Convolution"
  bottom: "conv1_relu"
  top: "new_conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "new_conv1"
	top: "bn_new_conv1"
	name: "bn_new_conv1"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "new_conv1"
	top: "bn_new_conv1"
	name: "bn_new_conv1"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn_new_conv1"
	top: "scale_new_conv1"
	name: "scale_new_conv1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "new_conv1_relu"
  type: "ReLU"
  bottom: "scale_new_conv1"
  top: "new_conv1_relu"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "new_conv1_relu"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2a_branch1"
	top: "bn2a_branch1"
	name: "bn2a_branch1"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2a_branch1"
	top: "bn2a_branch1"
	name: "bn2a_branch1"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2a_branch1"
	top: "scale2a_branch1"
	name: "scale2a_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2a_branch2a"
	top: "bn2a_branch2a"
	name: "bn2a_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2a_branch2a"
	top: "bn2a_branch2a"
	name: "bn2a_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2a_branch2a"
	top: "scale2a_branch2a"
	name: "scale2a_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "scale2a_branch2a"
  top: "res2a_branch2a_relu"
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a_relu"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2a_branch2b"
	top: "bn2a_branch2b"
	name: "bn2a_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2a_branch2b"
	top: "bn2a_branch2b"
	name: "bn2a_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2a_branch2b"
	top: "scale2a_branch2b"
	name: "scale2a_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "scale2a_branch2b"
  top: "res2a_branch2b_relu"
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b_relu"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2a_branch2c"
	top: "bn2a_branch2c"
	name: "bn2a_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2a_branch2c"
	top: "bn2a_branch2c"
	name: "bn2a_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2a_branch2c"
	top: "scale2a_branch2c"
	name: "scale2a_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "scale2a_branch1"
  bottom: "scale2a_branch2c"
  name: "res2a"
  top: "res2a"
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a_relu"
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a_relu"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2b_branch2a"
	top: "bn2b_branch2a"
	name: "bn2b_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2b_branch2a"
	top: "bn2b_branch2a"
	name: "bn2b_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2b_branch2a"
	top: "scale2b_branch2a"
	name: "scale2b_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "scale2b_branch2a"
  top: "res2b_branch2a_relu"
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a_relu"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2b_branch2b"
	top: "bn2b_branch2b"
	name: "bn2b_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2b_branch2b"
	top: "bn2b_branch2b"
	name: "bn2b_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2b_branch2b"
	top: "scale2b_branch2b"
	name: "scale2b_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "scale2b_branch2b"
  top: "res2b_branch2b_relu"
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b_relu"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2b_branch2c"
	top: "bn2b_branch2c"
	name: "bn2b_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2b_branch2c"
	top: "bn2b_branch2c"
	name: "bn2b_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2b_branch2c"
	top: "scale2b_branch2c"
	name: "scale2b_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res2a_relu"
  bottom: "scale2b_branch2c"
  name: "res2b"
  top: "res2b"
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b_relu"
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b_relu"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2c_branch2a"
	top: "bn2c_branch2a"
	name: "bn2c_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2c_branch2a"
	top: "bn2c_branch2a"
	name: "bn2c_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2c_branch2a"
	top: "scale2c_branch2a"
	name: "scale2c_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "scale2c_branch2a"
  top: "res2c_branch2a_relu"
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a_relu"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2c_branch2b"
	top: "bn2c_branch2b"
	name: "bn2c_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2c_branch2b"
	top: "bn2c_branch2b"
	name: "bn2c_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2c_branch2b"
	top: "scale2c_branch2b"
	name: "scale2c_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "scale2c_branch2b"
  top: "res2c_branch2b_relu"
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b_relu"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res2c_branch2c"
	top: "bn2c_branch2c"
	name: "bn2c_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res2c_branch2c"
	top: "bn2c_branch2c"
	name: "bn2c_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn2c_branch2c"
	top: "scale2c_branch2c"
	name: "scale2c_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res2b_relu"
  bottom: "scale2c_branch2c"
  name: "res2c"
  top: "res2c"
}
layer {
  name: "res2c_relu"
  type: "ReLU"
  bottom: "res2c"
  top: "res2c_relu"
}
layer {
  name: "res3_1_branch1"
  type: "Convolution"
  bottom: "res2c_relu"
  top: "res3_1_branch1"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_1_branch1"
	top: "bn3_1_branch1"
	name: "bn3_1_branch1"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_1_branch1"
	top: "bn3_1_branch1"
	name: "bn3_1_branch1"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_1_branch1"
	top: "scale3_1_branch1"
	name: "scale3_1_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_1_branch2a"
  type: "Convolution"
  bottom: "res2c_relu"
  top: "res3_1_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_1_branch2a"
	top: "bn3_1_branch2a"
	name: "bn3_1_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_1_branch2a"
	top: "bn3_1_branch2a"
	name: "bn3_1_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_1_branch2a"
	top: "scale3_1_branch2a"
	name: "scale3_1_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_1_branch2a_relu"
  type: "ReLU"
  bottom: "scale3_1_branch2a"
  top: "res3_1_branch2a_relu"
}
layer {
  name: "res3_1_branch2b"
  type: "Convolution"
  bottom: "res3_1_branch2a_relu"
  top: "res3_1_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_1_branch2b"
	top: "bn3_1_branch2b"
	name: "bn3_1_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_1_branch2b"
	top: "bn3_1_branch2b"
	name: "bn3_1_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_1_branch2b"
	top: "scale3_1_branch2b"
	name: "scale3_1_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_1_branch2b_relu"
  type: "ReLU"
  bottom: "scale3_1_branch2b"
  top: "res3_1_branch2b_relu"
}
layer {
  name: "res3_1_branch2c"
  type: "Convolution"
  bottom: "res3_1_branch2b_relu"
  top: "res3_1_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_1_branch2c"
	top: "bn3_1_branch2c"
	name: "bn3_1_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_1_branch2c"
	top: "bn3_1_branch2c"
	name: "bn3_1_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_1_branch2c"
	top: "scale3_1_branch2c"
	name: "scale3_1_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "scale3_1_branch1"
  bottom: "scale3_1_branch2c"
  name: "res3_1"
  top: "res3_1"
}
layer {
  name: "res3_1_relu"
  type: "ReLU"
  bottom: "res3_1"
  top: "res3_1_relu"
}
layer {
  name: "res3_2_branch2a"
  type: "Convolution"
  bottom: "res3_1_relu"
  top: "res3_2_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_2_branch2a"
	top: "bn3_2_branch2a"
	name: "bn3_2_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_2_branch2a"
	top: "bn3_2_branch2a"
	name: "bn3_2_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_2_branch2a"
	top: "scale3_2_branch2a"
	name: "scale3_2_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_2_branch2a_relu"
  type: "ReLU"
  bottom: "scale3_2_branch2a"
  top: "res3_2_branch2a_relu"
}
layer {
  name: "res3_2_branch2b"
  type: "Convolution"
  bottom: "res3_2_branch2a_relu"
  top: "res3_2_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_2_branch2b"
	top: "bn3_2_branch2b"
	name: "bn3_2_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_2_branch2b"
	top: "bn3_2_branch2b"
	name: "bn3_2_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_2_branch2b"
	top: "scale3_2_branch2b"
	name: "scale3_2_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_2_branch2b_relu"
  type: "ReLU"
  bottom: "scale3_2_branch2b"
  top: "res3_2_branch2b_relu"
}
layer {
  name: "res3_2_branch2c"
  type: "Convolution"
  bottom: "res3_2_branch2b_relu"
  top: "res3_2_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_2_branch2c"
	top: "bn3_2_branch2c"
	name: "bn3_2_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_2_branch2c"
	top: "bn3_2_branch2c"
	name: "bn3_2_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_2_branch2c"
	top: "scale3_2_branch2c"
	name: "scale3_2_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_1_relu"
  bottom: "scale3_2_branch2c"
  name: "res3_2"
  top: "res3_2"
}
layer {
  name: "res3_2_relu"
  type: "ReLU"
  bottom: "res3_2"
  top: "res3_2_relu"
}
layer {
  name: "res3_3_branch2a"
  type: "Convolution"
  bottom: "res3_2_relu"
  top: "res3_3_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_3_branch2a"
	top: "bn3_3_branch2a"
	name: "bn3_3_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_3_branch2a"
	top: "bn3_3_branch2a"
	name: "bn3_3_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_3_branch2a"
	top: "scale3_3_branch2a"
	name: "scale3_3_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_3_branch2a_relu"
  type: "ReLU"
  bottom: "scale3_3_branch2a"
  top: "res3_3_branch2a_relu"
}
layer {
  name: "res3_3_branch2b"
  type: "Convolution"
  bottom: "res3_3_branch2a_relu"
  top: "res3_3_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_3_branch2b"
	top: "bn3_3_branch2b"
	name: "bn3_3_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_3_branch2b"
	top: "bn3_3_branch2b"
	name: "bn3_3_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_3_branch2b"
	top: "scale3_3_branch2b"
	name: "scale3_3_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_3_branch2b_relu"
  type: "ReLU"
  bottom: "scale3_3_branch2b"
  top: "res3_3_branch2b_relu"
}
layer {
  name: "res3_3_branch2c"
  type: "Convolution"
  bottom: "res3_3_branch2b_relu"
  top: "res3_3_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_3_branch2c"
	top: "bn3_3_branch2c"
	name: "bn3_3_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_3_branch2c"
	top: "bn3_3_branch2c"
	name: "bn3_3_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_3_branch2c"
	top: "scale3_3_branch2c"
	name: "scale3_3_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_2_relu"
  bottom: "scale3_3_branch2c"
  name: "res3_3"
  top: "res3_3"
}
layer {
  name: "res3_3_relu"
  type: "ReLU"
  bottom: "res3_3"
  top: "res3_3_relu"
}
layer {
  name: "res3_4_branch2a"
  type: "Convolution"
  bottom: "res3_3_relu"
  top: "res3_4_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_4_branch2a"
	top: "bn3_4_branch2a"
	name: "bn3_4_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_4_branch2a"
	top: "bn3_4_branch2a"
	name: "bn3_4_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_4_branch2a"
	top: "scale3_4_branch2a"
	name: "scale3_4_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_4_branch2a_relu"
  type: "ReLU"
  bottom: "scale3_4_branch2a"
  top: "res3_4_branch2a_relu"
}
layer {
  name: "res3_4_branch2b"
  type: "Convolution"
  bottom: "res3_4_branch2a_relu"
  top: "res3_4_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_4_branch2b"
	top: "bn3_4_branch2b"
	name: "bn3_4_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_4_branch2b"
	top: "bn3_4_branch2b"
	name: "bn3_4_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_4_branch2b"
	top: "scale3_4_branch2b"
	name: "scale3_4_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_4_branch2b_relu"
  type: "ReLU"
  bottom: "scale3_4_branch2b"
  top: "res3_4_branch2b_relu"
}
layer {
  name: "res3_4_branch2c"
  type: "Convolution"
  bottom: "res3_4_branch2b_relu"
  top: "res3_4_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_4_branch2c"
	top: "bn3_4_branch2c"
	name: "bn3_4_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_4_branch2c"
	top: "bn3_4_branch2c"
	name: "bn3_4_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_4_branch2c"
	top: "scale3_4_branch2c"
	name: "scale3_4_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_3_relu"
  bottom: "scale3_4_branch2c"
  name: "res3_4"
  top: "res3_4"
}
layer {
  name: "res3_4_relu"
  type: "ReLU"
  bottom: "res3_4"
  top: "res3_4_relu"
}
layer {
  name: "res3_5_branch2a"
  type: "Convolution"
  bottom: "res3_4_relu"
  top: "res3_5_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_5_branch2a"
	top: "bn3_5_branch2a"
	name: "bn3_5_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_5_branch2a"
	top: "bn3_5_branch2a"
	name: "bn3_5_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_5_branch2a"
	top: "scale3_5_branch2a"
	name: "scale3_5_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_5_branch2a_relu"
  type: "ReLU"
  bottom: "scale3_5_branch2a"
  top: "res3_5_branch2a_relu"
}
layer {
  name: "res3_5_branch2b"
  type: "Convolution"
  bottom: "res3_5_branch2a_relu"
  top: "res3_5_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_5_branch2b"
	top: "bn3_5_branch2b"
	name: "bn3_5_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_5_branch2b"
	top: "bn3_5_branch2b"
	name: "bn3_5_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_5_branch2b"
	top: "scale3_5_branch2b"
	name: "scale3_5_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_5_branch2b_relu"
  type: "ReLU"
  bottom: "scale3_5_branch2b"
  top: "res3_5_branch2b_relu"
}
layer {
  name: "res3_5_branch2c"
  type: "Convolution"
  bottom: "res3_5_branch2b_relu"
  top: "res3_5_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_5_branch2c"
	top: "bn3_5_branch2c"
	name: "bn3_5_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_5_branch2c"
	top: "bn3_5_branch2c"
	name: "bn3_5_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_5_branch2c"
	top: "scale3_5_branch2c"
	name: "scale3_5_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_4_relu"
  bottom: "scale3_5_branch2c"
  name: "res3_5"
  top: "res3_5"
}
layer {
  name: "res3_5_relu"
  type: "ReLU"
  bottom: "res3_5"
  top: "res3_5_relu"
}
layer {
  name: "res3_6_branch2a"
  type: "Convolution"
  bottom: "res3_5_relu"
  top: "res3_6_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_6_branch2a"
	top: "bn3_6_branch2a"
	name: "bn3_6_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_6_branch2a"
	top: "bn3_6_branch2a"
	name: "bn3_6_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_6_branch2a"
	top: "scale3_6_branch2a"
	name: "scale3_6_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_6_branch2a_relu"
  type: "ReLU"
  bottom: "scale3_6_branch2a"
  top: "res3_6_branch2a_relu"
}
layer {
  name: "res3_6_branch2b"
  type: "Convolution"
  bottom: "res3_6_branch2a_relu"
  top: "res3_6_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_6_branch2b"
	top: "bn3_6_branch2b"
	name: "bn3_6_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_6_branch2b"
	top: "bn3_6_branch2b"
	name: "bn3_6_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_6_branch2b"
	top: "scale3_6_branch2b"
	name: "scale3_6_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_6_branch2b_relu"
  type: "ReLU"
  bottom: "scale3_6_branch2b"
  top: "res3_6_branch2b_relu"
}
layer {
  name: "res3_6_branch2c"
  type: "Convolution"
  bottom: "res3_6_branch2b_relu"
  top: "res3_6_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_6_branch2c"
	top: "bn3_6_branch2c"
	name: "bn3_6_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_6_branch2c"
	top: "bn3_6_branch2c"
	name: "bn3_6_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_6_branch2c"
	top: "scale3_6_branch2c"
	name: "scale3_6_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_5_relu"
  bottom: "scale3_6_branch2c"
  name: "res3_6"
  top: "res3_6"
}
layer {
  name: "res3_6_relu"
  type: "ReLU"
  bottom: "res3_6"
  top: "res3_6_relu"
}
layer {
  name: "res3_7_branch2a"
  type: "Convolution"
  bottom: "res3_6_relu"
  top: "res3_7_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_7_branch2a"
	top: "bn3_7_branch2a"
	name: "bn3_7_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_7_branch2a"
	top: "bn3_7_branch2a"
	name: "bn3_7_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_7_branch2a"
	top: "scale3_7_branch2a"
	name: "scale3_7_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_7_branch2a_relu"
  type: "ReLU"
  bottom: "scale3_7_branch2a"
  top: "res3_7_branch2a_relu"
}
layer {
  name: "res3_7_branch2b"
  type: "Convolution"
  bottom: "res3_7_branch2a_relu"
  top: "res3_7_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_7_branch2b"
	top: "bn3_7_branch2b"
	name: "bn3_7_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_7_branch2b"
	top: "bn3_7_branch2b"
	name: "bn3_7_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_7_branch2b"
	top: "scale3_7_branch2b"
	name: "scale3_7_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_7_branch2b_relu"
  type: "ReLU"
  bottom: "scale3_7_branch2b"
  top: "res3_7_branch2b_relu"
}
layer {
  name: "res3_7_branch2c"
  type: "Convolution"
  bottom: "res3_7_branch2b_relu"
  top: "res3_7_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_7_branch2c"
	top: "bn3_7_branch2c"
	name: "bn3_7_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_7_branch2c"
	top: "bn3_7_branch2c"
	name: "bn3_7_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_7_branch2c"
	top: "scale3_7_branch2c"
	name: "scale3_7_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_6_relu"
  bottom: "scale3_7_branch2c"
  name: "res3_7"
  top: "res3_7"
}
layer {
  name: "res3_7_relu"
  type: "ReLU"
  bottom: "res3_7"
  top: "res3_7_relu"
}
layer {
  name: "res3_8_branch2a"
  type: "Convolution"
  bottom: "res3_7_relu"
  top: "res3_8_branch2a"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_8_branch2a"
	top: "bn3_8_branch2a"
	name: "bn3_8_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_8_branch2a"
	top: "bn3_8_branch2a"
	name: "bn3_8_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_8_branch2a"
	top: "scale3_8_branch2a"
	name: "scale3_8_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_8_branch2a_relu"
  type: "ReLU"
  bottom: "scale3_8_branch2a"
  top: "res3_8_branch2a_relu"
}
layer {
  name: "res3_8_branch2b"
  type: "Convolution"
  bottom: "res3_8_branch2a_relu"
  top: "res3_8_branch2b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_8_branch2b"
	top: "bn3_8_branch2b"
	name: "bn3_8_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_8_branch2b"
	top: "bn3_8_branch2b"
	name: "bn3_8_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_8_branch2b"
	top: "scale3_8_branch2b"
	name: "scale3_8_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res3_8_branch2b_relu"
  type: "ReLU"
  bottom: "scale3_8_branch2b"
  top: "res3_8_branch2b_relu"
}
layer {
  name: "res3_8_branch2c"
  type: "Convolution"
  bottom: "res3_8_branch2b_relu"
  top: "res3_8_branch2c"
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res3_8_branch2c"
	top: "bn3_8_branch2c"
	name: "bn3_8_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res3_8_branch2c"
	top: "bn3_8_branch2c"
	name: "bn3_8_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn3_8_branch2c"
	top: "scale3_8_branch2c"
	name: "scale3_8_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res3_7_relu"
  bottom: "scale3_8_branch2c"
  name: "res3_8"
  top: "res3_8"
}
layer {
  name: "res3_8_relu"
  type: "ReLU"
  bottom: "res3_8"
  top: "res3_8_relu"
}
layer {
  name: "res4_1_branch1"
  type: "Convolution"
  bottom: "res3_8_relu"
  top: "res4_1_branch1"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_1_branch1"
	top: "bn4_1_branch1"
	name: "bn4_1_branch1"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_1_branch1"
	top: "bn4_1_branch1"
	name: "bn4_1_branch1"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn4_1_branch1"
	top: "scale4_1_branch1"
	name: "scale4_1_branch1"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_1_branch2a"
  type: "Convolution"
  bottom: "res3_8_relu"
  top: "res4_1_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 2
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_1_branch2a"
	top: "bn4_1_branch2a"
	name: "bn4_1_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_1_branch2a"
	top: "bn4_1_branch2a"
	name: "bn4_1_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn4_1_branch2a"
	top: "scale4_1_branch2a"
	name: "scale4_1_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_1_branch2a_relu"
  type: "ReLU"
  bottom: "scale4_1_branch2a"
  top: "res4_1_branch2a_relu"
}
layer {
  name: "res4_1_branch2b"
  type: "Convolution"
  bottom: "res4_1_branch2a_relu"
  top: "res4_1_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_1_branch2b"
	top: "bn4_1_branch2b"
	name: "bn4_1_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_1_branch2b"
	top: "bn4_1_branch2b"
	name: "bn4_1_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn4_1_branch2b"
	top: "scale4_1_branch2b"
	name: "scale4_1_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_1_branch2b_relu"
  type: "ReLU"
  bottom: "scale4_1_branch2b"
  top: "res4_1_branch2b_relu"
}
layer {
  name: "res4_1_branch2c"
  type: "Convolution"
  bottom: "res4_1_branch2b_relu"
  top: "res4_1_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_1_branch2c"
	top: "bn4_1_branch2c"
	name: "bn4_1_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_1_branch2c"
	top: "bn4_1_branch2c"
	name: "bn4_1_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn4_1_branch2c"
	top: "scale4_1_branch2c"
	name: "scale4_1_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "scale4_1_branch1"
  bottom: "scale4_1_branch2c"
  name: "res4_1"
  top: "res4_1"
}
layer {
  name: "res4_1_relu"
  type: "ReLU"
  bottom: "res4_1"
  top: "res4_1_relu"
}
layer {
  name: "res4_2_branch2a"
  type: "Convolution"
  bottom: "res4_1_relu"
  top: "res4_2_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_2_branch2a"
	top: "bn4_2_branch2a"
	name: "bn4_2_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_2_branch2a"
	top: "bn4_2_branch2a"
	name: "bn4_2_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn4_2_branch2a"
	top: "scale4_2_branch2a"
	name: "scale4_2_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_2_branch2a_relu"
  type: "ReLU"
  bottom: "scale4_2_branch2a"
  top: "res4_2_branch2a_relu"
}
layer {
  name: "res4_2_branch2b"
  type: "Convolution"
  bottom: "res4_2_branch2a_relu"
  top: "res4_2_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_2_branch2b"
	top: "bn4_2_branch2b"
	name: "bn4_2_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_2_branch2b"
	top: "bn4_2_branch2b"
	name: "bn4_2_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn4_2_branch2b"
	top: "scale4_2_branch2b"
	name: "scale4_2_branch2b"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_2_branch2b_relu"
  type: "ReLU"
  bottom: "scale4_2_branch2b"
  top: "res4_2_branch2b_relu"
}
layer {
  name: "res4_2_branch2c"
  type: "Convolution"
  bottom: "res4_2_branch2b_relu"
  top: "res4_2_branch2c"
  convolution_param {
    num_output: 1024
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_2_branch2c"
	top: "bn4_2_branch2c"
	name: "bn4_2_branch2c"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_2_branch2c"
	top: "bn4_2_branch2c"
	name: "bn4_2_branch2c"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn4_2_branch2c"
	top: "scale4_2_branch2c"
	name: "scale4_2_branch2c"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  type: "Eltwise"
  bottom: "res4_1_relu"
  bottom: "scale4_2_branch2c"
  name: "res4_2"
  top: "res4_2"
}
layer {
  name: "res4_2_relu"
  type: "ReLU"
  bottom: "res4_2"
  top: "res4_2_relu"
}
layer {
  name: "res4_3_branch2a"
  type: "Convolution"
  bottom: "res4_2_relu"
  top: "res4_3_branch2a"
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_3_branch2a"
	top: "bn4_3_branch2a"
	name: "bn4_3_branch2a"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_3_branch2a"
	top: "bn4_3_branch2a"
	name: "bn4_3_branch2a"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "bn4_3_branch2a"
	top: "scale4_3_branch2a"
	name: "scale4_3_branch2a"
	type: "Scale"
	scale_param {
		bias_term: true
	}
}
layer {
  name: "res4_3_branch2a_relu"
  type: "ReLU"
  bottom: "scale4_3_branch2a"
  top: "res4_3_branch2a_relu"
}
layer {
  name: "res4_3_branch2b"
  type: "Convolution"
  bottom: "res4_3_branch2a_relu"
  top: "res4_3_branch2b"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 1
    bias_term: false
    weight_filler {
      type: "msra"
    }
  }
}
layer {
	bottom: "res4_3_branch2b"
	top: "bn4_3_branch2b"
	name: "bn4_3_branch2b"
	type: "BatchNorm"
	include {
		phase: TRAIN
	}
	batch_norm_param {
		use_global_stats: false
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

layer {
	bottom: "res4_3_branch2b"
	top: "bn4_3_branch2b"
	name: "bn4_3_branch2b"
	type: "BatchNorm"
	include {
		phase: TEST
	}
	batch_norm_param {
		use_global_stats: true
	}
	param {
    		lr_mult: 0
  	}
	 param {
    		lr_mult: 0
  	}
  	param {
    		lr_mult: 0
  	}
}

